# DefaultOpenFromCloudCallback Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
DefaultOpenFromCloudCallback Constructor
DefaultOpenFromCloudCallback Class See Also
---
Create a default open callback. Open latest by default for all scenarios.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public DefaultOpenFromCloudCallback()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
DefaultOpenFromCloudCallback()
```

# See Also
DefaultOpenFromCloudCallback Class
Autodesk.Revit.DB Namespace